In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
import seaborn as sns

In [2]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [3]:
one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)

In [4]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [5]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [6]:
pd.concat([one,two],axis = 1) #Since we want to join them by columns we have to specify axis=1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [7]:
pd.concat([one,two],axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [8]:
# If we want in below the a b df we make the columns of both df same

In [9]:
two.columns = one.columns

In [10]:
mydf = pd.concat([one,two])

In [11]:
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [12]:
mydf.index = range(len(mydf)) ## To set new df index after the concatination

In [13]:
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

In [14]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [15]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [16]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [17]:
pd.merge(registrations,logins,how='inner', on='name') ## In inner merge, order of the data frames does not matter

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [18]:
pd.merge(registrations,logins,how = 'left', on = 'name').fillna('did not show up!')## All the names in the left hand table needs to be present in the result table

   reg_id    name            log_id
0       1  Andrew               2.0
1       2    Bobo               4.0
2       3  Claire  did not show up!
3       4   David  did not show up!

In [19]:
pd.merge(registrations,logins,how='right',on='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [20]:
pd.merge(registrations,logins,how='right',on='name').fillna("Didn't register") #All the names in the right table will be presetn in the result table

            reg_id     name  log_id
0  Didn't register   Xavier       1
1              1.0   Andrew       2
2  Didn't register  Yolanda       3
3              2.0     Bobo       4

In [21]:
pd.merge(registrations,logins,how='outer',on='name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [22]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [23]:
registrations = registrations.set_index('name')

In [24]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [25]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [26]:
pd.merge(registrations,logins,left_index=True,right_on = "name",how = 'inner')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [27]:
registrations = registrations.reset_index()

In [144]:
registrations.columns = ['reg_name','reg_id']

In [145]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [146]:
# If no column name are same we can use this method

In [147]:
pd.merge(registrations,logins,left_on='reg_name',right_on='name',how='inner').drop('reg_name',axis=1 )

   reg_id  id    name
0       1   2  Andrew
1       2   4    Bobo

In [148]:
registrations.columns = ['name','id']
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [149]:
logins.columns = ['id','name']

In [150]:
pd.merge(registrations,logins,on='name',how = 'outer') ## If there are column with same names pandas is smart enought to rename them

      name  id_x  id_y
0   Andrew   1.0   2.0
1     Bobo   2.0   4.0
2   Claire   3.0   NaN
3    David   4.0   NaN
4   Xavier   NaN   1.0
5  Yolanda   NaN   3.0

In [ ]:
pd.merge(registrations,logins,on='name',how = 'outer',suffixes=('_reg','_log')) # We can also provide thw name in case we want to use a custom name for the columns

      name  id_reg  id_log
0   Andrew     1.0     2.0
1     Bobo     2.0     4.0
2   Claire     3.0     NaN
3    David     4.0     NaN
4   Xavier     NaN     1.0
5  Yolanda     NaN     3.0

## Text Method with pandas

In [ ]:
names = pd.Series(["Bob","cat","dog",'jose',"5"])

In [ ]:
names

0     Bob
1     cat
2     dog
3    jose
4       5
dtype: object

In [ ]:
names.str.upper()

0     BOB
1     CAT
2     DOG
3    JOSE
4       5
dtype: object

In [ ]:
stonks = ['x,c,v','y,h,b']

In [ ]:
stocks = pd.Series(stonks)

In [ ]:
stocks.str.split(',')

0    [x, c, v]
1    [y, h, b]
dtype: object

In [ ]:
## NOw if we want to access

In [ ]:
stocks.str.split(',').str[0] ## .str is the pandas way to interpret it as a string

0    x
1    y
dtype: object

In [ ]:
stocks.str.split(',',expand=True) ## Expands splits them into new columns

   0  1  2
0  x  c  v
1  y  h  b

In [ ]:
messy_names = pd.Series(["andrew  ","bo;bo","  claire  "])

In [ ]:
messy_names

0      andrew
1         bo;bo
2      claire
dtype: object

In [ ]:
messy_names.str.strip().str.replace(";",'').str.capitalize() ## We might have to stack the string calls to make our data look cleaner

0    Andrew
1      Bobo
2    Claire
dtype: object

In [ ]:
## Or we can use the apply method

In [ ]:
def clean(name):
    name = name.strip()
    name = name.replace(';','')
    name = name.capitalize()
    return name

In [ ]:
messy_names.apply(clean)  ## This looks much cleaner than stacking the string functions

0    Andrew
1      Bobo
2    Claire
dtype: object

In [132]:
from datetime import datetime

In [133]:
myser = pd.Series(['Nov 3, 2000', '2000-01-01', None])

In [134]:
myser

0    Nov 3, 2000
1     2000-01-01
2           None
dtype: object

In [137]:
time_ser = pd.to_datetime(myser) ## Pandas automatically converts this into date time

In [138]:
time_ser[0].year

2000

https://docs.python.org/3/library/datetime.html#strftime-and-strptime-format-codes

In [139]:
# Refer to this link for the conversions

In [140]:
style_date = '12--Dec--2000'

In [142]:
pd.to_datetime(style_date,format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [151]:
df =pd.read_csv('/Users/kathanbhavsar/Desktop/Python,DS,ML/03-Pandas/RetailSales_BeerWineLiquor.csv')

In [153]:
df['DATE'] =pd.to_datetime(df['DATE'])

In [155]:
df["DATE"]

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [158]:
df = pd.read_csv('/Users/kathanbhavsar/Desktop/Python,DS,ML/03-Pandas/RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [159]:
df

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [160]:
df['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [161]:
df["DATE"][0].year

1992